// "use strict"

// Цикл while
// let i = 0;
// while(i<3){
//     console.log(i); // перший раз 0, другий раз 1, третійраз 2
//     i++; // або i+=1
// }

// let weight = prompt('Введіть вагу')
// if(weight < 0){
//     weight = prompt("Введіть вагу: Вага не може бути менше 0")
// }
// console.log(`Ваша вага у фунтах ${weight/0.453}`)


// let weight = prompt("Введіть вагу")
// //Нам треба щоб вага була більше 0
// while(weight < 0){
// weight = prompt("Введіть вагу: Вага не може бути менше 0")
// }
// console.log(`Ваша вага у фунтах ${weight / 0.453}`)

// Цикл do … while
// let weight= 0
// do {
// weight = prompt("Введіть вагу");
// }while (weight < 0); 
// console.log(`Ваша вага у фунтах ${weight / 0.453}`)

// Цикл for
// for (let i = 0; i < 10; i+=1) { // виведе 0, потім 1, потім 2 
//      alert(i);
//     } 

//     початок let i = 0 Виконується один раз при вході в цикл. Це початкове значення.
// Умова i < 3 Перевіряється перед кожною ітерацією циклу. Якщо воно обчислиться false, цикл зупиниться.
// тіло alert(i) Виконується знову і знову, доки умова обчислюється в true.
// крок i+=1 Виконується після тіла циклу кожної ітерації перед перевіркою умови.

// Як воно працює:
// Виконати початок  let i = 0
// → (Якщо умова == true → Виконати тіло, Виконати крок) записати 0
// → (Якщо умова == true → Виконати тіло, Виконати крок) записати 1
// → (Якщо умова == true → Виконати тіло, Виконати крок) записати 2
// → ... Зупинити виконання так як I = 3 це не підходить нам так як ми до 3 дивимось. Тобто отримуємо  false.

// for () – Перевіряє умову перед кожною ітерацією, чи є можливість задати додаткові налаштування.

// Давайте розглянемо більш схожий на реальне життя випадок.
// Уявіть ситуацію що людині треба заповнити анкету ми питаємо в нього чи готовий він розпочати ? 
// Якщо він натиская ОК у змінну answer зберігається 
// true і в середині блоку if за допомогою циклу for ми виводимо зворотній відлік.

// const answer = confirm("Готові заповнити анкету?");
// if(answer) {
//     for(let i = 3; i > 0; i -= 1) {
//         alert(i);
//     }
//     const name = prompt("Введіть ваше імя")
//     const lastName = prompt("Ведіть ваше прізвище");
//     const middleName = prompt("Введіть по батькові");
// 	const result = `${name}, ${lastName},${middleName}`
// 	alert(result)
// }


// Оператор break
// let userName = prompt("Введіть імя");

// while(!userName) {
//     userName = prompt("Ведите не пустое имя");
//     if(userName === null) {
//         break;
//     }
// }
// if(userName) {
//     console.log(`Добро пожаловать, ${userName}`);
// }
// else {
//     console.log("Не очень то и хотелось")
// }

// Оператор continue

// Давайте напишемо программу для ліфту. Яка виводить номер поверху доки людина підіймається на свій
//  поверх. Але програма для Китаю. А в Китаї число 4 вважається не счастливим і
//   часто там немає 4 поверху взагалі. Відповідно коли ми дістанемось 4 поверху ми повинні
//    вивести інше значення.

// const floor = prompt("Введіть ваш поверх");
// for(let i = 1; i <= floor; i++) {
//     if(i === 4) {
//         console.log(`немає поверху`);
//         continue;
//     }
//     console.log(`${i} поверх`);
// }
// console.log("Ваш поверх!");

// Коли зустрічає continue він одразу переходить до наступної ітерації.
