// Приклад того як ми писали до тернарного оператора

// const year = propmt("В якому році вийшов перший фільм Star Wars");
// let message = ""
// if (year == 1977){
//  message = "Все вірно"
// }else{
//  message = "Невірно"
// }
// console.log(message)

// Теж саме тільки ми запишемо через тернарний оператор

// const year = 1977
// const result = year == 1977 ? "Все вірно" : "Невірно"
// console.log(result)


//Запитайте у користувача гостроту зору. Якщо вона краще, Ніж -6,
//присвойте йому статус "годен до військової служби". Якщо менше – "Не годен до військової служби".
// Якщо ми робимо через if...else

// const userDiopter = prompt("Введіть свою гостроту зору");
// let status = "";
// if(userDiopter > -6) {
//  status = "годен до військової служби"
// }
// else {
//  status = "Не годен до військової служби"
// }
// console.log(status)

// Теж саме тільки ми запишемо через тернарний оператор
// const userDiopter = prompt("Введіть свою гостроту зору");
// const status = (userDiopter > -6)? 'годен до військової служби':' Не годен до військової служби'
// console.log(status)
